export interface CourseItem {
  isActive?: boolean;
  id: string;
  title: string;
  description: string;
  iconName: string;
  url?: string;
  price?: string;
  originalPrice?: string;
  thumbnail?: string;
  fullDescription?: string;
  sections?: {title: string, items: string[]}[];
  schedules?: string[];
  metadata?: string[];
}

export interface CourseCategory {
  id: string;
  title: string;
  iconName: string;
  subcategories: {
    id: string;
    title: string;
    courses: CourseItem[];
  }[];
}

export const COURSE_CATEGORIES: CourseCategory[] = [
  {
    "id": "cat-mindmap-1",
    "title": "مهارت های پایه کامپیوتر",
    "iconName": "Monitor",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-1",
        "title": "مهارت های پایه کامپیوتر",
        "courses": [
          {
            "id": "course-19",
            "title": "زبان تخصصی کامپیوتر ویژه بزرگسالان",
            "description": "دوره زبان تخصصی کامپیوتر ویژه بزرگسالان؛ آموزش اصطلاحات و واژگان تخصصی IT، درک متون فنی انگلیسی، مناسب برنامه‌نویسان و فعالان فناوری اطلاعات.",
            "fullDescription": "دوره زبان تخصصی کامپیوتر ویژه بزرگسالان؛ آموزش اصطلاحات و واژگان تخصصی IT، درک متون فنی انگلیسی، مناسب برنامه‌نویسان و فعالان فناوری اطلاعات.",
            "sections": [],
            "price": "5,415,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/english-for-it/",
            "schedules": [
              "زبان تخصصی کامپیوتر بزرگسال پنجشنبه ۹ تا ۱۲ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-5",
            "title": "شئ گرایی در پایتون ویژه نوجوانان",
            "description": "0 تا 100 پایتون همراه با پروژه",
            "fullDescription": "0 تا 100 پایتون همراه با پروژه",
            "sections": [],
            "price": "7,435,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/oop-kids/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پایتون نوجوانان",
              "زبان: فارسی",
              "40 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-10",
            "title": "پایتون نوجوانان",
            "description": "پایتون چیست؟ ",
            "fullDescription": "پایتون چیست؟ ",
            "sections": [],
            "price": "7,435,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/python-kids/",
            "schedules": [
              "پایتون نوجوان گروه ۱۰ یکشنبه ۱۵ تا ۱۸ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "زبان: فارسی",
              "24 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-20",
            "title": "اسکرچ ویژه کودکان",
            "description": "دوره اسکرچ کودکان نوین تک | آموزش برنامه‌نویسی خلاقانه",
            "fullDescription": "دوره اسکرچ کودکان نوین تک | آموزش برنامه‌نویسی خلاقانه",
            "sections": [],
            "price": "7,435,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/scratch/",
            "schedules": [
              "اسکرچ گروه ۳ پنجشنبه ۹ تا ۱۲ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "زبان: فارسی",
              "20 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-28",
            "title": "بازی سازی با پایتون ویژه نوجوانان",
            "description": "کتاب خانه های مورد نیاز و معروف پایتون برای یادگیری ماشین و کار با داده ها.",
            "fullDescription": "کتاب خانه های مورد نیاز و معروف پایتون برای یادگیری ماشین و کار با داده ها.",
            "sections": [],
            "price": "7,435,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/game-junior/",
            "schedules": [
              "بازی‌سازی نوجوان گروه ۶ یکشنبه ۱۵ تا ۱۸ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پایتون نوجوانان",
              "زبان: فارسی",
              "40 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-6",
            "title": "ICDL جامع",
            "description": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "fullDescription": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "sections": [],
            "price": "8,265,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/icdl/",
            "schedules": [
              "ICDL گروه ۱۰ سه‌شنبه ۱۵ تا ۱۸ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "70 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-17",
            "title": "آموزش جامع روش تحقیق و مقاله نویسی ویژه بینایی ماشین",
            "description": "هوش مصنوعی ؟ پایتون و ریاضیات هوش مصتوعی مقاله",
            "fullDescription": "هوش مصنوعی ؟ پایتون و ریاضیات هوش مصتوعی مقاله",
            "sections": [],
            "price": "5,100,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/articlefor-vision/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: بینایی ماشین",
              "زبان: فارسی",
              "50 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-24",
            "title": "آموزش جامع لینکدین برای فریلنسرها",
            "description": "لینکدین، یک شبکه‌ی اجتماعی حرفه‌ای با بیش از ۸۳۰ میلیون کاربر از تقریبا ۲۰۰ کشور دنیاست که در سال 2003 تاسیس شد. LinkedIn فضایی ایده‌آل برای فریلنسرها جهت",
            "fullDescription": "لینکدین، یک شبکه‌ی اجتماعی حرفه‌ای با بیش از ۸۳۰ میلیون کاربر از تقریبا ۲۰۰ کشور دنیاست که در سال 2003 تاسیس شد. LinkedIn فضایی ایده‌آل برای فریلنسرها جهت",
            "sections": [],
            "price": "4,110,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/linkdin/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: متعاقبا اعلام می گردد.",
              "زبان: فارسی",
              "25ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-27",
            "title": "ماتریکس جامع طلا و جواهر",
            "isActive": false,
            "description": "آموزش حرفه‌ای طراحی طلا و جواهر با ماتریکس یک مسیر آموزشی کامل و پروژه‌محور است که از مفاهیم پایه تا تکنیک‌های پیشرفته طراحی جواهرات دیجیتال را پوشش می‌دهد.",
            "fullDescription": "آموزش حرفه‌ای طراحی طلا و جواهر با ماتریکس یک مسیر آموزشی کامل و پروژه‌محور است که از مفاهیم پایه تا تکنیک‌های پیشرفته طراحی جواهرات دیجیتال را پوشش می‌دهد.",
            "sections": [],
            "price": "8,700,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/comprehensive-matrix/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "24 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "cat-mindmap-2",
    "title": "برنامه نویسی بک اند",
    "iconName": "TerminalSquare",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-2",
        "title": "برنامه نویسی بک اند",
        "courses": [
          {
            "id": "course-2",
            "title": "ربات نویسی تلگرام با پایتون",
            "description": "اهمیت یادگیری ساخت ربات تلگرام با پایتون (Python) چیست؟",
            "fullDescription": "اهمیت یادگیری ساخت ربات تلگرام با پایتون (Python) چیست؟",
            "sections": [],
            "price": "7,220,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/bot-tel/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پایتون جامع",
              "زبان: فارسی",
              "25 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-3",
            "title": "برنامه نویسی موبایل جامع",
            "description": "آموزش زبان برنامه نویسی جاوا و مقدماتی اندروید.",
            "fullDescription": "آموزش زبان برنامه نویسی جاوا و مقدماتی اندروید.",
            "sections": [],
            "price": "8,265,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/android-java/",
            "schedules": [
              "برنامه‌نویسی موبایل ۱۱ سه‌شنبه ۱۸ تا ۲۱ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پایتون جامع",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "60 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-7",
            "title": "اپلیکیشن نویسی پیشرفته موبایل",
            "description": "به توسعه نرم‌افزارها و اپلیکیشن‌ها برای سیستم‌عامل اندروید برنامه‌نویسی اندروید (Android programming) می‌گویند. سیستم‌عامل اندروید یک سیستم‌عامل مبتنی بر",
            "fullDescription": "به توسعه نرم‌افزارها و اپلیکیشن‌ها برای سیستم‌عامل اندروید برنامه‌نویسی اندروید (Android programming) می‌گویند. سیستم‌عامل اندروید یک سیستم‌عامل مبتنی بر",
            "sections": [],
            "price": "8,838,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/android-advance/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: برنامه نویسی موبایل جامع",
              "زبان: فارسی",
              "60 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-9",
            "title": "دوره پایتون جامع",
            "description": "0 تا 100 پایتون همراه با پروژه",
            "fullDescription": "0 تا 100 پایتون همراه با پروژه",
            "sections": [],
            "price": "8,265,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/python/",
            "schedules": [
              "پایتون ۲۸ پنجشنبه ۹ تا ۱۲ شعبه ۲",
              "پایتون ۲۷ شنبه ۱۶ تا ۲۰ شعبه ۱",
              "پایتون ۲۶ دوشنبه ۱۶ تا ۲۰ شعبه ۱"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "زبان: فارسی",
              "50 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-11",
            "title": "مبانی کامپیوتر ++c",
            "description": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "fullDescription": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "sections": [],
            "price": "5,225,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/cpp/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "زبان: فارسی",
              "40 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-26",
            "title": "پایگاه داده SQLite3",
            "description": "در حال حاضر بسیاری از برنامه‌های نرم‌افزاری از پایگاه داده SQLite برای ذخیره داده‌های خود استفاده می‌کنند. همچنین، این پایگاه داده، سرعت بسیار بالایی را در",
            "fullDescription": "در حال حاضر بسیاری از برنامه‌های نرم‌افزاری از پایگاه داده SQLite برای ذخیره داده‌های خود استفاده می‌کنند. همچنین، این پایگاه داده، سرعت بسیار بالایی را در",
            "sections": [],
            "price": "7,435,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/sqlite3/",
            "schedules": [
              "پایگاه داده ۹ چهارشنبه ۱۵ تا ۱۸ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پایتون جامع",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "25 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-34",
            "title": "مبانی برنامه نویسی #c",
            "description": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "fullDescription": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "sections": [],
            "price": "5,050,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/c-sharp/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: 17 آبان",
              "زبان: فارسی",
              "40 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-36",
            "title": "آموزش Git  و  GitHub",
            "description": "به کمک Git می‌توان به‌راحتی مدیریت پروژه‌های مختلف برنامه‌نویسی را انجام داد. در اصل گیت نوعی کنترلر است که به کمک آن می‌توانید چند کار مهم انجام دهید. شما",
            "fullDescription": "به کمک Git می‌توان به‌راحتی مدیریت پروژه‌های مختلف برنامه‌نویسی را انجام داد. در اصل گیت نوعی کنترلر است که به کمک آن می‌توانید چند کار مهم انجام دهید. شما",
            "sections": [],
            "price": "1,100,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/github/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "12 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-37",
            "title": "Django-DRF",
            "description": "دوره آموزش جنگو و DRF: یادگیری ساخت وب‌اپلیکیشن‌های حرفه‌ای با Django و Django REST Framework، از مفاهیم پایه تا پیاده‌سازی پروژه‌های پیشرفته.",
            "fullDescription": "دوره آموزش جنگو و DRF: یادگیری ساخت وب‌اپلیکیشن‌های حرفه‌ای با Django و Django REST Framework، از مفاهیم پایه تا پیاده‌سازی پروژه‌های پیشرفته.",
            "sections": [],
            "price": "8,838,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/django-drf/",
            "schedules": [
              "DRF-Django یکشنبه ۱۸ تا ۲۱ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پایتون جامع-پایگاه داده",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "60 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-40",
            "title": "پایتون CS50",
            "description": "0 تا 100 پایتون همراه با پروژه",
            "fullDescription": "0 تا 100 پایتون همراه با پروژه",
            "sections": [],
            "price": "7,435,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/python-cs50/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: متعاقبا اعلام میگردد.",
              "زبان: فارسی",
              "50 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "cat-mindmap-3",
    "title": "هوش مصنوعی",
    "iconName": "Brain",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-3",
        "title": "هوش مصنوعی",
        "courses": [
          {
            "id": "course-8",
            "title": "پردازش تصویر و بینایی ماشین",
            "description": "پردازش تصاویر، به فرایند تحلیل، تغییر و استخراج اطلاعات از تصاویر با استفاده از الگوریتم‌ها و روش‌های مختلف در زمینه کامپیوتر و بینایی ماشین اطلاق می‌شود.",
            "fullDescription": "پردازش تصاویر، به فرایند تحلیل، تغییر و استخراج اطلاعات از تصاویر با استفاده از الگوریتم‌ها و روش‌های مختلف در زمینه کامپیوتر و بینایی ماشین اطلاق می‌شود.",
            "sections": [],
            "price": "9,450,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/vision/",
            "schedules": [
              "ویژن ۵ یکشنبه ۱۸ تا ۲۱ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: یادگیری عمیق",
              "زبان: فارسی",
              "60 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-23",
            "title": "یادگیری عمیق و شبکه عصبی کانولوشن",
            "description": "یادگیری عمیق (Deep Learning)، یک شاخه از یادگیری ماشین است که با استفاده از شبکه‌های عصبی عمیق و الگوریتم‌های مرتبط، به پیش‌بینی و طبقه‌بندی داده‌ها می‌پردازد.",
            "fullDescription": "یادگیری عمیق (Deep Learning)، یک شاخه از یادگیری ماشین است که با استفاده از شبکه‌های عصبی عمیق و الگوریتم‌های مرتبط، به پیش‌بینی و طبقه‌بندی داده‌ها می‌پردازد.",
            "sections": [],
            "price": "9,820,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/deep-learning/",
            "schedules": [
              "یادگیری عمیق گروه ۶ چهارشنبه ۱۶ تا ۲۰ شعبه ۱"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: علم داده و یادگیری ماشین",
              "زبان: فارسی",
              "60 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-25",
            "title": "علم داده و یادگیری ماشین",
            "description": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "fullDescription": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "sections": [],
            "price": "8,550,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/machine-learning-data-analysis/",
            "schedules": [
              "علم داده ۹ دوشنبه ۱۵ تا ۱۸ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "سطح دوره: پیشرفته",
              "پیش نیاز: پایتون جامع",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "60 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-30",
            "title": "هوش مصنوعی و تحلیل داده در بازار های مالی",
            "description": "در این درس ضمن آموختن اصول پایه ای برنامه نویسی، نحوه استفاده از هوش مصنوعی در بازار مالی و هر آن چه که برای تحلیل بازار های مالی نیاز دارید، کار با یکی از",
            "fullDescription": "در این درس ضمن آموختن اصول پایه ای برنامه نویسی، نحوه استفاده از هوش مصنوعی در بازار مالی و هر آن چه که برای تحلیل بازار های مالی نیاز دارید، کار با یکی از",
            "sections": [],
            "price": "7,220,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/finance-ai/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پایتون جامع",
              "زبان: فارسی",
              "25 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-33",
            "title": "ابزار های هوش مصنوعی و پرامپت نویسی",
            "description": "هوش مصنوعی چت جی‌پی‌تی (ChatGPT) در زمان عرضه‌ی خود،‌ رکورد سریع‌ترین رشد در بین نرم‌افزارها رو شکست. بیشتر از ۱۰۰ میلیون کاربر در تنها ۲ ماه! به نظر من چت",
            "fullDescription": "هوش مصنوعی چت جی‌پی‌تی (ChatGPT) در زمان عرضه‌ی خود،‌ رکورد سریع‌ترین رشد در بین نرم‌افزارها رو شکست. بیشتر از ۱۰۰ میلیون کاربر در تنها ۲ ماه! به نظر من چت",
            "sections": [],
            "price": "13,500,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/chatgpt/",
            "schedules": [
              "ابزار هوش مصنوعی گروه ۱۵ سه‌شنبه ۱۸ تا ۲۱ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "زبان: فارسی",
              "25 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-35",
            "title": "هوش تجاری با microsoft power BI",
            "description": "هوش مصنوعی ؟ پایتون و ریاضیات هوش مصتوعی مقاله",
            "fullDescription": "هوش مصنوعی ؟ پایتون و ریاضیات هوش مصتوعی مقاله",
            "sections": [],
            "price": "7,220,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/powerbi/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "40 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-39",
            "title": "شبکه های عصبی بازگشتی",
            "description": "آموزش شبکه های عصبی بازگشتی با پروژه های کاربردی",
            "fullDescription": "آموزش شبکه های عصبی بازگشتی با پروژه های کاربردی",
            "sections": [],
            "price": "10,080,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/rnn/",
            "schedules": [
              "RNN G3 دوشنبه ۹ تا ۱۲ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پردازش تصویر و بینایی ماشین",
              "زبان: فارسی",
              "60 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "cat-mindmap-4",
    "title": "کودک و نوجوان",
    "iconName": "Gamepad2",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-4",
        "title": "کودک و نوجوان",
        "courses": [
          {
            "id": "course-4",
            "title": "زبان مهارتی نوجوان",
            "description": "دوره زبان مهارتی نوجوان Start Easy در ۱۰ جلسه، با تمرکز بر مکالمه، جمله‌سازی و گرامر پایه انگلیسی. مناسب نوجوانانی که می‌خواهند از پایه شروع کنند.",
            "fullDescription": "دوره زبان مهارتی نوجوان Start Easy در ۱۰ جلسه، با تمرکز بر مکالمه، جمله‌سازی و گرامر پایه انگلیسی. مناسب نوجوانانی که می‌خواهند از پایه شروع کنند.",
            "sections": [],
            "price": "5,415,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/dore-zaban-maharati-nojavan/",
            "schedules": [
              "زبان مهارتی نوجوان شنبه ۹ تا ۱۲ شعبه ۲",
              "زبان مهارتی نوجوان چهارشنبه ۹ تا ۱۲ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-41",
            "title": "زبان تخصصی کامپیوتر ویژه نوجوانان",
            "description": "دوره زبان تخصصی کامپیوتر ویژه بزرگسالان؛ آموزش اصطلاحات و واژگان تخصصی IT، درک متون فنی انگلیسی، مناسب برنامه‌نویسان و فعالان فناوری اطلاعات.",
            "fullDescription": "دوره زبان تخصصی کامپیوتر ویژه بزرگسالان؛ آموزش اصطلاحات و واژگان تخصصی IT، درک متون فنی انگلیسی، مناسب برنامه‌نویسان و فعالان فناوری اطلاعات.",
            "sections": [],
            "price": "5,415,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/it-english-course-for-teens/",
            "schedules": [
              "زبان تخصصی کامپیوتر نوجوان سه‌شنبه ۱۵ تا ۱۸ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "cat-mindmap-5",
    "title": "بازی سازی",
    "iconName": "Ghost",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-5",
        "title": "بازی سازی",
        "courses": []
      }
    ]
  },
  {
    "id": "cat-mindmap-6",
    "title": "طراحی سایت",
    "iconName": "Globe",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-6",
        "title": "طراحی سایت",
        "courses": [
          {
            "id": "course-1",
            "title": "وردپرس جامع",
            "description": "طراحی سایت وردپرس WordPress چیست؟ ",
            "fullDescription": "طراحی سایت وردپرس WordPress چیست؟ ",
            "sections": [],
            "price": "8,838,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/wp-ecommerce/",
            "schedules": [
              "وردپرس ۶ نوجوان چهارشنبه ۱۵ تا ۱۸ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "24 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-12",
            "title": "آموزش جامع بک اند سایت با php",
            "description": "توضیحات کوتاه در دسترس نیست.",
            "fullDescription": "توضیحات کامل در دسترس نیست.",
            "price": "8,838,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/php/",
            "schedules": [
              "PHP 5 دوشنبه ۹ تا ۱۲ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پک فرانت اند مقدماتی",
              "زبان: فارسی",
              "50 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-13",
            "title": "مهندسی بک اند | Node.js، Express، TypeScript و NestJS",
            "description": "توضیحات کوتاه در دسترس نیست.",
            "fullDescription": "توضیحات کامل در دسترس نیست.",
            "price": "13,500,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/backend-course-nodejs-nestjs/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پک فرانت اند جامع",
              "زبان: فارسی",
              "50 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-29",
            "title": "پک فرانت اند جامع",
            "description": "پک فرانت اند مقدماتی (,HTML و CSS )چیست؟",
            "fullDescription": "پک فرانت اند مقدماتی (,HTML و CSS )چیست؟",
            "sections": [],
            "price": "9,715,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/front-end/",
            "schedules": [
              "پک فرانت ۹ دوشنبه ۱۶ تا ۲۰ شعبه ۱"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "80 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-38",
            "title": "مهندسی فرانت‌اند – React & Next.js",
            "description": "مهندسی فرانت‌اند - React & Next.js",
            "fullDescription": "مهندسی فرانت‌اند - React & Next.js",
            "sections": [],
            "price": "8,838,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/frontend-master/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: پک فرانت اند جامع",
              "زبان: فارسی",
              "50 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "cat-mindmap-7",
    "title": "گرافیک",
    "iconName": "Palette",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-7",
        "title": "گرافیک",
        "courses": [
          {
            "id": "course-14",
            "title": "فتوشاپ جامع مهندسی کامپیوتر",
            "description": "دوره جامع آموزش فتوشاپ مهندسی کامپیوتر: یادگیری اصول تا تکنیک‌های حرفه‌ای طراحی و ویرایش تصاویر، مناسب برای علاقه‌مندان و حرفه‌ای‌ها.",
            "fullDescription": "دوره جامع آموزش فتوشاپ مهندسی کامپیوتر: یادگیری اصول تا تکنیک‌های حرفه‌ای طراحی و ویرایش تصاویر، مناسب برای علاقه‌مندان و حرفه‌ای‌ها.",
            "sections": [],
            "price": "13,500,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/photoshop/",
            "schedules": [
              "فتوشاپ گروه ۳ شنبه ۱۸ تا ۲۱ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "زبان: فارسی",
              "20 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-15",
            "title": "طراحی رابط کاربری ui/ux",
            "description": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "fullDescription": "یادگیری ماشین و علم داده یک حوزه مهم در علوم کامپیوتر و هوش مصنوعی است که به ماشین‌ها و سیستم‌های کامپیوتری اس. به طور کلی، هدف از یادگیری ماشین، توسعه",
            "sections": [],
            "price": "7,435,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/ui-ux/",
            "schedules": [
              "UI/UX گروه ۷ یکشنبه ۱۵ تا ۱۸ شعبه ۲"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "25 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "cat-mindmap-8",
    "title": "معماری",
    "iconName": "Building",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-8",
        "title": "معماری",
        "courses": []
      }
    ]
  },
  {
    "id": "cat-mindmap-9",
    "title": "حسابداری",
    "iconName": "Calculator",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-9",
        "title": "حسابداری",
        "courses": [
          {
            "id": "course-0",
            "title": "حسابداری مقدماتی",
            "isActive": false,
            "description": "توضیحات کوتاه در دسترس نیست.",
            "fullDescription": "توضیحات کامل در دسترس نیست.",
            "price": "ناموجود",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/%d8%ad%d8%b3%d8%a7%d8%a8%d8%af%d8%a7%d8%b1%db%8c-%d9%85%d9%82%d8%af%d9%85%d8%a7%d8%aa%db%8c/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "40 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-16",
            "title": "آموزش نرم افزار سپیدار و کاربرد اکسل در حسابداری (مقدماتی)",
            "isActive": false,
            "description": "توضیحات کوتاه در دسترس نیست.",
            "fullDescription": "توضیحات کامل در دسترس نیست.",
            "price": "ناموجود",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/sepidar/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "50 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-22",
            "title": "آموزش کاربردی اکسل در حسابداری",
            "description": "توضیحات کوتاه در دسترس نیست.",
            "fullDescription": "توضیحات کامل در دسترس نیست.",
            "price": "12,150,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/excel-in-accounting/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "15 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "cat-mindmap-10",
    "title": "شبکه",
    "iconName": "Network",
    "subcategories": [
      {
        "id": "sub-cat-mindmap-10",
        "title": "شبکه",
        "courses": [
          {
            "id": "course-18",
            "title": "مهندسی شبکه و زیرساخت‌های سازمانی لینوکس (LPIC-2)",
            "description": "آموزش جامع LPIC-2 برای مدیریت شبکه و زیرساخت‌های سازمانی لینوکس؛ شامل DNS، وب‌سرور، ایمیل سرور، امنیت، فایروال، ذخیره‌سازی پیشرفته و مانیتورینگ سیستم.",
            "fullDescription": "آموزش جامع LPIC-2 برای مدیریت شبکه و زیرساخت‌های سازمانی لینوکس؛ شامل DNS، وب‌سرور، ایمیل سرور، امنیت، فایروال، ذخیره‌سازی پیشرفته و مانیتورینگ سیستم.",
            "sections": [],
            "price": "12,150,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/lpic-2-linux-network-infrastructure-course/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: اصول مدیریت سیستم‌عامل لینوکس (LPIC-1)",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "24 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-21",
            "title": "هک و امنیت شبکه",
            "description": "هک و امنیت با پایتون چیست؟",
            "fullDescription": "هک و امنیت با پایتون چیست؟",
            "sections": [],
            "price": "25,280,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/cyber-security/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: +Network و سابقه کار مرتبط با شبکه",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "50 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-31",
            "title": "+Network",
            "description": "+network چیست؟ ",
            "fullDescription": "+network چیست؟ ",
            "sections": [],
            "price": "3,700,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/network/",
            "schedules": [
              "نتورک پلاس ۸ شنبه ۱۶ تا ۲۰ شعبه ۱"
            ],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "40 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          },
          {
            "id": "course-32",
            "title": "اصول مدیریت سیستم‌عامل لینوکس (LPIC-1)",
            "description": "با شرکت در دوره آموزش لینوکس LPIC-1، مسیر ورود به دنیای شبکه، سرور و دواپس را آغاز کنید. آموزش کاملاً عملی و پروژه محور مدیریت سیستم‌عامل لینوکس.",
            "fullDescription": "با شرکت در دوره آموزش لینوکس LPIC-1، مسیر ورود به دنیای شبکه، سرور و دواپس را آغاز کنید. آموزش کاملاً عملی و پروژه محور مدیریت سیستم‌عامل لینوکس.",
            "sections": [],
            "price": "12,150,000 تومان",
            "iconName": "Monitor",
            "url": "https://itech-co.ir/product/linux-lpic-1-course/",
            "schedules": [],
            "metadata": [
              "نوع دوره: حضوری",
              "پیش نیاز: ندارد",
              "تاریخ شروع: به محض تکمیل ظرفیت",
              "زبان: فارسی",
              "24 ساعت",
              "گواهی نامه بین المللی معتبر قابل ترجمه"
            ]
          }
        ]
      }
    ]
  }
];
